{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "EsmForSequenceClassification",
    "parent_library": "transformers.models.esm.modeling_esm"
  },
  "base_model_name_or_path": "esm2_8m_base",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": "gaussian",
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 8,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "key",
    "query",
    "classifier.dense",
    "classifier.out_proj"
  ],
  "task_type": null,
  "use_rslora": false
}